Revit 2026 API

# ControlledApplicationFailuresProcessing Event

---

Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<FailuresProcessingEventArgs> FailuresProcessing
```
```vb
Public Event FailuresProcessing As EventHandler(Of FailuresProcessingEventArgs)
```
```cpp
public:
 event EventHandler<FailuresProcessingEventArgs^>^ FailuresProcessing {
	void add (EventHandler<FailuresProcessingEventArgs^>^ value);
	void remove (EventHandler<FailuresProcessingEventArgs^>^ value);
}
```
```fsharp
member FailuresProcessing : IEvent<EventHandler<FailuresProcessingEventArgs>,
    FailuresProcessingEventArgs>
```

#### Value

EventHandlerFailuresProcessingEventArgs

This event is raised when failures are being processed during transaction commit or rollback operations. Handlers of this event have a limited ability to modify the document and/or failures in it, using provided restricted failures accessor interface.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace